## Staging: load_balancer
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 2 to add, 1 to change, 2 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_iam_role_policy.firehose_waf_logs will be updated in-place
  ~ resource "aws_iam_role_policy" "firehose_waf_logs" {
        id     = "firehose_waf_logs:firehose-waf-logs-policy"
        name   = "firehose-waf-logs-policy"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action   = [
                          - "s3:AbortMultipartUpload",
                          - "s3:GetBucketLocation",
                          - "s3:GetObject",
                          - "s3:ListBucket",
                          - "s3:ListBucketMultipartUploads",
                            "s3:PutObject",
                          + "s3:ListBucketMultipartUploads",
                          + "s3:ListBucket",
                          + "s3:GetObject",
                          + "s3:GetBucketLocation",
                          + "s3:AbortMultipartUpload",
                        ]
                      ~ Resource = [
                          - "arn:aws:s3:::forms-staging-terraform-waf-logs",
                          - "arn:aws:s3:::forms-staging-terraform-waf-logs/*",
                          + "arn:aws:s3:::cbs-satellite-687401027353/*",
                          + "arn:aws:s3:::cbs-satellite-687401027353",
                        ]
                        # (2 unchanged elements hidden)
                    },
                  ~ {
                      + Sid      = ""
                        # (3 unchanged elements hidden)
                    },
                ]
                # (1 unchanged element hidden)
            }
        )
        # (1 unchanged attribute hidden)
    }

  # aws_kinesis_firehose_delivery_stream.firehose_waf_logs must be replaced
-/+ resource "aws_kinesis_firehose_delivery_stream" "firehose_waf_logs" {
      ~ arn            = "arn:aws:firehose:ca-central-1:687401027353:deliverystream/aws-waf-logs-forms" -> (known after apply)
      ~ destination    = "s3" -> "extended_s3" # forces replacement
      ~ destination_id = "destinationId-000000000001" -> (known after apply)
      ~ id             = "arn:aws:firehose:ca-central-1:687401027353:deliverystream/aws-waf-logs-forms" -> (known after apply)
        name           = "aws-waf-logs-forms"
        tags           = {
            "CostCentre" = "forms-platform-staging"
            "Terraform"  = "true"
        }
      ~ version_id     = "4" -> (known after apply)
        # (1 unchanged attribute hidden)

      + extended_s3_configuration {
          + bucket_arn         = "arn:aws:s3:::cbs-satellite-687401027353"
          + buffer_interval    = 300
          + buffer_size        = 5
          + compression_format = "GZIP"
          + prefix             = "waf_acl_logs/AWSLogs/687401027353/"
          + role_arn           = "arn:aws:iam::687401027353:role/firehose_waf_logs"
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = (known after apply)
              + log_group_name  = (known after apply)
              + log_stream_name = (known after apply)
            }
        }

      - s3_configuration {
          - bucket_arn         = "arn:aws:s3:::forms-staging-terraform-waf-logs" -> null
          - buffer_interval    = 300 -> null
          - buffer_size        = 5 -> null
          - compression_format = "UNCOMPRESSED" -> null
          - role_arn           = "arn:aws:iam::687401027353:role/firehose_waf_logs" -> null

          - cloudwatch_logging_options {
              - enabled = false -> null
            }
        }

      ~ server_side_encryption {
            # (2 unchanged attributes hidden)
        }
    }

  # aws_wafv2_web_acl_logging_configuration.firehose_waf_logs_forms must be replaced
-/+ resource "aws_wafv2_web_acl_logging_configuration" "firehose_waf_logs_forms" {
      ~ id                      = "arn:aws:wafv2:ca-central-1:687401027353:regional/webacl/GCForms/e8fc1b67-9d4d-4a29-8c94-65b37b30a231" -> (known after apply)
      ~ log_destination_configs = [
          - "arn:aws:firehose:ca-central-1:687401027353:deliverystream/aws-waf-logs-forms",
        ] -> (known after apply) # forces replacement
        # (1 unchanged attribute hidden)
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh

18 tests, 18 passed, 0 warnings, 0 failures, 0 exceptions

```

</details>
